In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("data/scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [3]:
print(df['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [4]:
df['Age'].mean()

59.125

In [8]:
df['Age'] >  df['Age'].mean() # 마스크

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [9]:
df[[False, True, True, True, False, False, False, True]]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [6]:
# 평균나이보다 많은 사람을 출력
df[df['Age'] >  df['Age'].mean()] # 마스킹

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [10]:
df['Age'][df['Age'] >  df['Age'].mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [11]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [25]:
pd.to_datetime(df['Died'], format='%Y-%m-%d') \
- pd.to_datetime(df['Born'], format='%Y-%m-%d')

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [27]:
Born = pd.to_datetime(df['Born'], format='%Y-%m-%d')
Died = pd.to_datetime(df['Died'], format='%Y-%m-%d')
df['Born_dt'], df['Died_dt'] = Born, Died

In [28]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   Born_dt     8 non-null      datetime64[ns]
 6   Died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [33]:
(Died - Born) / 365

0   37 days 18:00:59.178082191
1   61 days 09:08:23.013698630
2   90 days 07:29:45.205479452
3   66 days 16:46:01.643835616
4   56 days 22:09:32.054794520
5   45 days 06:50:18.082191780
6   41 days 23:36:19.726027397
7   77 days 20:50:37.808219178
dtype: timedelta64[ns]

In [34]:
df['age_days_dt'] = (Died - Born) / 365
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37 days 18:00:59.178082191
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61 days 09:08:23.013698630
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90 days 07:29:45.205479452
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66 days 16:46:01.643835616
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56 days 22:09:32.054794520
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45 days 06:50:18.082191780
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41 days 23:36:19.726027397
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77 days 20:50:37.808219178

In [37]:
# DataFrame에 있는 데이터를 파일에 저장
df.to_csv("data/df.csv")
df.to_csv("data/df.tsv", sep="\t")
df.to_csv("data/df1.csv", index=False)

pip install xlwt

In [38]:
import xlwt

In [39]:
df.to_excel("data/df.xls")

C:\Users\SCOOL\AppData\Local\Temp\ipykernel_1476\2195775229.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel("data/df.xls")

pip install openpyxl

In [40]:
import openpyxl

In [41]:
df.to_excel("data/df.xlsx")

In [42]:
df.to_excel("data/df1.xlsx", index=False)

In [43]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37 days 18:00:59.178082191
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61 days 09:08:23.013698630
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90 days 07:29:45.205479452
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66 days 16:46:01.643835616
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56 days 22:09:32.054794520
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45 days 06:50:18.082191780
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41 days 23:36:19.726027397
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77 days 20:50:37.808219178

In [44]:
# 열삭제
df = df.drop(['Born_dt', 'Died_dt', 'age_days_dt'], axis=1)

In [45]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [47]:
# 행삭제
df = df.drop([1, 3, 5], axis=0)
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [48]:
# Pandas 의 시계열
# 타임스탬프(timestamp : 1970년도 1월 1일부터 현재까지의 시간을 ms로 계산)
# 시간 간격, 기간 (period)
# 시간 델타, 지속기간 (duration)

In [49]:
from datetime import datetime
datetime(year=2015, month=7, day=4)

datetime.datetime(2015, 7, 4, 0, 0)

In [50]:
from dateutil import parser
date = parser.parse("4th of July, 2015")
date

datetime.datetime(2015, 7, 4, 0, 0)

In [51]:
date.strftime("%W")

'26'

In [52]:
import numpy as np
date = np.array('2015-07-04', dtype=np.datetime64)
date

array('2015-07-04', dtype='datetime64[D]')

In [53]:
date + np.arange(12)

array(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
       '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
       '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
      dtype='datetime64[D]')

In [54]:
np.datetime64('2015-07-04')

numpy.datetime64('2015-07-04')

In [55]:
np.datetime64('2015-07-04 12:00')

numpy.datetime64('2015-07-04T12:00')

In [56]:
np.datetime64('2015-07-04 12:59:59.50', 'ns')

numpy.datetime64('2015-07-04T12:59:59.500000000')

In [57]:
import pandas as pd
date = pd.to_datetime("4th of July, 2015")
date

Timestamp('2015-07-04 00:00:00')

In [58]:
date.strftime("%W")

'26'

In [59]:
date + pd.to_timedelta(np.arange(12), 'D')

DatetimeIndex(['2015-07-04', '2015-07-05', '2015-07-06', '2015-07-07',
               '2015-07-08', '2015-07-09', '2015-07-10', '2015-07-11',
               '2015-07-12', '2015-07-13', '2015-07-14', '2015-07-15'],
              dtype='datetime64[ns]', freq=None)

In [60]:
index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
                          '2015-07-04', '2015-08-04'])
data = pd.Series([0, 1, 2, 3], index=index)
data

2014-07-04    0
2014-08-04    1
2015-07-04    2
2015-08-04    3
dtype: int64

In [61]:
data['2014-07-04']

0

In [62]:
data['2014-07-04':'2015-07-04']

2014-07-04    0
2014-08-04    1
2015-07-04    2
dtype: int64

In [65]:
data['2015']

2015-07-04    2
2015-08-04    3
dtype: int64

In [66]:
data['2015-07']

2015-07-04    2
dtype: int64

In [67]:
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-07-2015', '20150708'])
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08'],
              dtype='datetime64[ns]', freq=None)

In [69]:
dates[0], dates[1]

(Timestamp('2015-07-03 00:00:00'), Timestamp('2015-07-04 00:00:00'))

In [70]:
dates[1] - dates[0]

Timedelta('1 days 00:00:00')

In [72]:
dates - dates[0]

TimedeltaIndex(['0 days', '1 days', '3 days', '4 days', '5 days'], dtype='timedelta64[ns]', freq=None)

In [73]:
# date_range
pd.date_range('2015-07-03', periods=8)

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

In [74]:
pd.date_range('2015-07-03', periods=8, freq='H')

DatetimeIndex(['2015-07-03 00:00:00', '2015-07-03 01:00:00',
               '2015-07-03 02:00:00', '2015-07-03 03:00:00',
               '2015-07-03 04:00:00', '2015-07-03 05:00:00',
               '2015-07-03 06:00:00', '2015-07-03 07:00:00'],
              dtype='datetime64[ns]', freq='H')

In [75]:
pd.period_range('2015-07', periods=8, freq='M')

PeriodIndex(['2015-07', '2015-08', '2015-09', '2015-10', '2015-11', '2015-12',
             '2016-01', '2016-02'],
            dtype='period[M]')

In [78]:
pd.date_range('2015-07-03', periods=8, freq='M')

DatetimeIndex(['2015-07-31', '2015-08-31', '2015-09-30', '2015-10-31',
               '2015-11-30', '2015-12-31', '2016-01-31', '2016-02-29'],
              dtype='datetime64[ns]', freq='M')

In [76]:
pd.timedelta_range(0, periods=10, freq='H')

TimedeltaIndex(['0 days 00:00:00', '0 days 01:00:00', '0 days 02:00:00',
                '0 days 03:00:00', '0 days 04:00:00', '0 days 05:00:00',
                '0 days 06:00:00', '0 days 07:00:00', '0 days 08:00:00',
                '0 days 09:00:00'],
               dtype='timedelta64[ns]', freq='H')

In [85]:
pd.timedelta_range('01:00:00', periods=10, freq='H')

TimedeltaIndex(['0 days 01:00:00', '0 days 02:00:00', '0 days 03:00:00',
                '0 days 04:00:00', '0 days 05:00:00', '0 days 06:00:00',
                '0 days 07:00:00', '0 days 08:00:00', '0 days 09:00:00',
                '0 days 10:00:00'],
               dtype='timedelta64[ns]', freq='H')

In [83]:
pd.date_range(0, periods=10, freq='H')

DatetimeIndex(['1970-01-01 00:00:00', '1970-01-01 01:00:00',
               '1970-01-01 02:00:00', '1970-01-01 03:00:00',
               '1970-01-01 04:00:00', '1970-01-01 05:00:00',
               '1970-01-01 06:00:00', '1970-01-01 07:00:00',
               '1970-01-01 08:00:00', '1970-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [86]:
pd.timedelta_range('01:00:00', periods=14, freq='H')

TimedeltaIndex(['0 days 01:00:00', '0 days 02:00:00', '0 days 03:00:00',
                '0 days 04:00:00', '0 days 05:00:00', '0 days 06:00:00',
                '0 days 07:00:00', '0 days 08:00:00', '0 days 09:00:00',
                '0 days 10:00:00', '0 days 11:00:00', '0 days 12:00:00',
                '0 days 13:00:00', '0 days 14:00:00'],
               dtype='timedelta64[ns]', freq='H')

In [88]:
pd.timedelta_range(0, periods=9, freq="2H30T")

TimedeltaIndex(['0 days 00:00:00', '0 days 02:30:00', '0 days 05:00:00',
                '0 days 07:30:00', '0 days 10:00:00', '0 days 12:30:00',
                '0 days 15:00:00', '0 days 17:30:00', '0 days 20:00:00'],
               dtype='timedelta64[ns]', freq='150T')

In [89]:
pd.timedelta_range(0, periods=9, freq="3D")

TimedeltaIndex([ '0 days',  '3 days',  '6 days',  '9 days', '12 days',
                '15 days', '18 days', '21 days', '24 days'],
               dtype='timedelta64[ns]', freq='3D')

In [91]:
pd.date_range('2022-05-13', periods=5, freq='D')

DatetimeIndex(['2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17'],
              dtype='datetime64[ns]', freq='D')

In [93]:
from pandas.tseries.offsets import BDay
pd.date_range('2022-05-13', periods=5, freq=BDay())

DatetimeIndex(['2022-05-13', '2022-05-16', '2022-05-17', '2022-05-18',
               '2022-05-19'],
              dtype='datetime64[ns]', freq='B')